app/controllers/stores_controller.rb

  def index
    @stores = Store.where(user_id: current_user.id)
---
SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = ?  [["user_id", 1]]

  def create
    @store = current_user.stores.build(store_params)
    respond_to do |format|
      if @store.save
---
INSERT INTO "stores" ("upload", "folderType", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["upload", "play-red.png"], ["folderType", "Folder2"], ["created_at", "2017-11-16 06:44:16.676590"], ["updated_at", "2017-11-16 06:44:16.676590"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @store.update(store_params)
---
UPDATE "stores" SET "folderType" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["folderType", "Folder1"], ["updated_at", "2017-11-16 07:08:47.655648"], ["id", 2]]